constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       24066;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       24466;
    }
    wall
    {
        type            wall;
        nFaces          1600;
        startFace       24866;
    }
    interface
    {
        type            patch;
        nFaces          206;
        startFace       26466;
    }
)


// ************************************************************************* //
