constant/solid/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//dynamicFvMesh   staticFvMesh;

dynamicFvMesh solidBodyMotionFvMesh;
solidBodyMotionFvMeshCoeffs
{
      solidBodyMotionFunction constantVelocity;
      constantVelocityCoeffs 
      {
				origin       (0 0 0);
				translationalVelocity    (0 0 0);
				rotationalVelocity      (0 0 400);
				//rotationalVelocity      (0 0 0);
				startMotionTime 0;
				inDegrees yes;
      }
}


// ************************************************************************* //
