constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//solidModel    linearGeometryTotalDisplacement;
//solidModel    unsLinearGeometry;
//solidModel    nonLinearGeometryTotalLagrangian;
//solidModel    nonLinearGeometryUpdatedLagrangian;
//solidModel    unsNonLinearGeometryTotalLagrangian;
solidModel     nonLinearGeometryTotalLagrangianTotalDisplacement;
nonLinearGeometryTotalLagrangianTotalDisplacementCoeffs
{
    // Maximum number of momentum correctors
    nCorrectors             1000;

    // Solution tolerance for displacement
    // solutionTolerance       1e-11;

    // Alternative solution tolerance for displacement
    // alternativeTolerance    1e-11;

    // Material law solution tolerance
    // materialTolerance       1e-05;

    // Write frequency for the residuals
    // infoFrequency           50;
}
"linearGeometryTotalDisplacementCoeffs|unsLinearGeometryCoeffs"
{
    // Maximum number of momentum correctors
    nCorrectors             100;
}

nonLinearGeometryTotalLagrangianCoeffs
{
    nCorrectors             100;
}

nonLinearGeometryUpdatedLagrangianCoeffs
{}

unsNonLinearGeometryTotalLagrangianCoeffs
{}

unsNonLinearGeometryUpdatedLagrangianCoeffs
{
	nCorrectors             100;
}

// ************************************************************************* //
